<html>

<head>
<meta http-equiv="Content-Language" content="en-us">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<title>The^day^of^DooM:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; AVR-OS 0.2</title>
</head>

<body>

<p style="margin-top: 3; margin-bottom: 3" align="center"><b>
<font size="5" color="#0000FF">AVR-OS</font></b></p>
<p style="margin-top: 3; margin-bottom: 3" align="center"><b><font size="1">
VERSION<span lang="bg"> </span></font></b><b><span lang="bg">0.</span>3</b></p>
<p><a href="Example.asm">Example.asm</a> (<a href="Example.hex">Example.hex</a>)</p>
<p style="margin-top: 0; margin-bottom: 0"><b><font size="4" color="#0000FF">AVR-OS</font></b>:</p>
<p style="margin-top: 0; margin-bottom: 0">&nbsp;</p>
<p style="margin-top: 0; margin-bottom: 0"><a href="AVR-OS.inc">AVR-OS.inc</a></p>

<p style="margin-top: 0; margin-bottom: 0"><a href="AVR-OS-API.inc">
AVR-OS-API.inc</a></p>

<p style="margin-top: 0; margin-bottom: 0">&nbsp;</p>

<p style="margin-top: 0; margin-bottom: 0"><a href="AVR-OS-IRQ.inc">
AVR-OS-IRQ.inc</a></p>

<p style="margin-top: 0; margin-bottom: 0"><a href="AVR-OS-IRQ-API.inc">
AVR-OS-IRQ-API.inc</a></p>

<p style="margin-top: 0; margin-bottom: 0">&nbsp;</p>

<p style="margin-top: 0; margin-bottom: 0"><a href="AVR-OS-TASK.inc">
AVR-OS-TASK.inc</a></p>

<p style="margin-top: 0; margin-bottom: 0"><a href="AVR-OS-TASK-API.inc">
AVR-OS-TASK-API.inc</a></p>

<p style="margin-top: 0; margin-bottom: 0">&nbsp;</p>

<p style="margin-top: 0; margin-bottom: 0"><a href="AVR-OS-TIMER.inc">
AVR-OS-TIMER.inc</a></p>

<p style="margin-top: 0; margin-bottom: 0"><a href="AVR-OS-TIMER-API.inc">
AVR-OS-TIMER-API.inc</a></p>

<p style="margin-top: 0; margin-bottom: 0">&nbsp;</p>

<p style="margin-top: 0; margin-bottom: 0"><a href="AVR-OS-MESSAGE.inc">
AVR-OS-MESSAGE.inc</a></p>

<p style="margin-top: 0; margin-bottom: 0"><a href="AVR-OS-MESSAGE-API.inc">
AVR-OS-MESSAGE-API.inc</a></p>

<p style="margin-top: 0; margin-bottom: 0">&nbsp;</p>

<p style="margin-top: 0; margin-bottom: 0"><span lang="bg">&#1057;&#1083;&#1077;&#1076; &#1087;&#1086;&#1088;&#1077;&#1076;&#1085;&#1080;&#1103; &#1076;&#1098;&#1083;&#1072;&#1098;&#1075; 
&#1080; &#1080;&#1079;&#1084;&#1086;&#1088;&#1080;&#1090;&#1077;&#1083;&#1077;&#1085; &#1076;&#1077;&#1085; &#1089;&#1090;&#1072;&#1072;&#1085; &#1095;&#1091;&#1076;&#1086;&#1090;&#1086; - &#1087;&#1086;&#1103;&#1074;&#1080; &#1089;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; 0.3 :) &#1053;&#1086; &#1087;&#1086; &#1089;&#1098;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086; - &#1080;&#1084;&#1072; 
&#1076;&#1086;&#1089;&#1090;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1081;&#1090;&#1086; &#1097;&#1077; &#1089;&#1077; &#1086;&#1090;&#1088;&#1072;&#1079;&#1103;&#1090; &#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1072; &#1085;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1090;&#1072; &#1074;&#1080; &#1089;&#1072;&#1084;&#1086; &#1072;&#1082;&#1086; &#1089;&#1090;&#1077; 
&#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1083;&#1080; &#1089;&#1090;&#1072;&#1088;&#1072;&#1090;&#1072; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1103; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;. &#1053;&#1086; &#1085;&#1077;&#1082;&#1072; &#1103; &#1087;&#1088;&#1080;&#1087;&#1086;&#1084;&#1085;&#1103; &#1074; 
&#1089;&#1083;&#1091;&#1095;&#1077;&#1081;, &#1095;&#1077; &#1085;&#1103;&#1082;&#1086;&#1081; &#1085;&#1077; &#1089;&#1077; &#1089;&#1077;&#1097;&#1072; &#1082;&#1072;&#1082;&#1074;&#1086; &#1080;&#1084;&#1072;&#1084; &#1074; &#1087;&#1088;&#1077;&#1076;&#1074;&#1080;&#1090;. &#1048;&#1076;&#1077;&#1103;&#1090;&#1072; &#1080; &#1073;&#1077;&#1096;&#1077;, &#1095;&#1077; &#1080;&#1084;&#1072;&#1084;&#1077; &#1077;&#1076;&#1085;&#1072; 
&#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1072; &#1074; </span><b>SRAM</b> (<b>TASK_MESSAGE</b>) <span lang="bg">&#1074; &#1082;&#1086;&#1103;&#1090;&#1086; &#1089;&#1077; 
&#1079;&#1072;&#1087;&#1080;&#1089;&#1074;&#1072; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086; &#1086;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1080; &#1089;&#1083;&#1077;&#1076;&#1074;&#1072;&#1097;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1075;&#1086; &#1087;&#1088;&#1086;&#1095;&#1077;&#1090;&#1077;. &#1053;&#1086; &#1086;&#1090; &#1090;&#1086;&#1074;&#1072; 
&#1089;&#1077; &#1087;&#1086;&#1103;&#1074;&#1080;&#1093;&#1072; &#1076;&#1074;&#1072; &#1075;&#1086;&#1083;&#1077;&#1084;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;:</span></p>

<p style="margin-top: 0; margin-bottom: 0">&nbsp;</p>

<p style="margin-top: 0; margin-bottom: 0"><span lang="bg">1) &#1057;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086; &#1074; 
&#1085;&#1072;&#1081;-&#1076;&#1086;&#1073;&#1088;&#1080;&#1103; &#1089;&#1083;&#1091;&#1095;&#1077;&#1081; &#1097;&#1077; &#1089;&#1077; &#1087;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1085;&#1086; &#1086;&#1090; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;</span></p>

<p style="margin-top: 0; margin-bottom: 0"><span lang="bg">2) &#1053;&#1086; &#1090;&#1086;&#1074;&#1072; &#1077; 
&#1085;&#1072;&#1081;-&#1076;&#1086;&#1073;&#1088;&#1080;&#1103; &#1074;&#1072;&#1088;&#1080;&#1103;&#1085;&#1090;... &#1051;&#1086;&#1096;&#1086;&#1090;&#1086; &#1077;, &#1095;&#1077; &#1080; </span><b>OS</b> <span lang="bg">&#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1096;&#1077; 
&#1090;&#1072;&#1079;&#1080; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1072;... &#1058;&#1072;&#1082;&#1072;, &#1095;&#1077; &#1089;&#1080; &#1073;&#1077;&#1096;&#1077; &#1041;&#1086;&#1078;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1076;&#1072;&#1083;&#1080; &#1097;&#1077; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1077; &#1076;&#1086; &#1094;&#1077;&#1083;&#1090;&#1072; &#1089;&#1080;...</span></p>

<p style="margin-top: 0; margin-bottom: 0">&nbsp;</p>

<p style="margin-top: 0; margin-bottom: 0"><span lang="bg">&#1047;&#1072;&#1088;&#1072;&#1076;&#1080; &#1090;&#1086;&#1074;&#1072; &#1089;&#1084;&#1077;&#1085;&#1080;&#1093; 
&#1080;&#1076;&#1077;&#1103;&#1090;&#1072; - &#1074;&#1077;&#1095;&#1077; &#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1084;</span> <span lang="bg">&#1089;&#1072;&#1084;&#1086; &#1077;&#1076;&#1085;&#1072; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1085;&#1072; &#1087;&#1088;&#1086;&#1084;&#1085;&#1083;&#1086;&#1074;&#1072; &#1079;&#1072; 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1090;&#1072;, &#1072; &#1074;&#1089;&#1077;&#1082;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1089;&#1080; &#1080;&#1084;&#1072; &#1089;&#1074;&#1086;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1085;&#1072; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1072;, &#1074; &#1082;&#1086;&#1103;&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1090;&#1077; 
&#1084;&#1086;&#1075;&#1072;&#1090; &#1076;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1074;&#1072;&#1090; :) &#1056;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072; &#1089;&#1077; &#1080; &#1090;&#1072;&#1082;&#1072; &#1084;&#1086;&#1075;&#1072;&#1090; &#1076;&#1072; &#1074;&#1098;&#1079;&#1085;&#1080;&#1082;&#1085;&#1072;&#1090; &#1085;&#1103;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080; &#1085;&#1086; &#1090;&#1077; 
&#1089;&#1072; &#1074; &#1088;&#1072;&#1084;&#1082;&#1080;&#1090;&#1077; &#1085;&#1072; &#1076;&#1086;&#1087;&#1086;&#1089;&#1090;&#1080;&#1084;&#1086;&#1090;&#1086; (&#1086;&#1089;&#1090;&#1072;&#1074;&#1103;&#1084; &#1042;&#1080; &#1076;&#1072; &#1089;&#1077; &#1076;&#1086;&#1089;&#1077;&#1090;&#1080;&#1090;&#1077; &#1082;&#1072;&#1074;&#1080; &#1097;&#1077; &#1076;&#1072; &#1089;&#1072; &#1090;&#1077; ;) ). 
&#1044;&#1088;&#1091;&#1075;&#1086;&#1090;&#1086; &#1085;&#1086;&#1074;&#1086;&#1074;&#1098;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1072; &#1079;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1080;&#1103;&#1090;&#1072; - &#1076;&#1072; &#1085;&#1072; </span>
HW <span lang="bg">&#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1080;&#1103; ;) &#1053;&#1086; &#1079;&#1072;&#1089;&#1077;&#1075;&#1072; &#1085;&#1077; &#1077; &#1088;&#1072;&#1079;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1074;&#1098;&#1074; &#1074;&#1080;&#1076; &#1091;&#1076;&#1086;&#1073;&#1077;&#1085; &#1079;&#1072; 
&#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1085;&#1077; &#1072; &#1080; &#1073;&#1098;&#1075;&#1086;&#1074;&#1077; &#1085;&#1077; &#1083;&#1080;&#1087;&#1089;&#1074;&#1072;&#1090;... &#1053;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1080; :) &#1048;&#1076;&#1077;&#1103;&#1090;&#1072; &#1080; &#1077;, &#1095;&#1077; &#1080;&#1084;&#1072;&#1084;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; 
&#1082;&#1086;&#1081;&#1090;&#1086; &#1072;&#1089;&#1080;&#1086;&#1094;&#1080;&#1088;&#1072; &#1085;&#1072; &#1076;&#1072;&#1076;&#1077;&#1085; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089; (&#1087;&#1086; &#1085;&#1086;&#1084;&#1077;&#1088;&#1077;&#1088;&#1072; &#1084;&#1091;), &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077; (&#1072; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1080;&#1103;&#1090;&#1072; 
&#1087;&#1088;&#1080;&#1090;&#1077;&#1078;&#1072;&#1074;&#1072;&#1074;&#1090; &#1089;&#1086;&#1073;&#1089;&#1074;&#1077;&#1085; &#1085;&#1086;&#1084;&#1077;&#1088;) &#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1082;&#1086;&#1103;&#1090;&#1086; &#1097;&#1077; &#1089;&#1077; &#1080;&#1079;&#1087;&#1098;&#1083;&#1085;&#1103;&#1074;&#1072; &#1087;&#1088;&#1080; &#1087;&#1086;&#1089;&#1090;&#1098;&#1087;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; 
&#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077;. &#1047;&#1072;&#1088;&#1072;&#1076;&#1080; &#1090;&#1086;&#1074;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;&#1090;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1089;&#1077; &#1079;&#1076;&#1086;&#1073;&#1080; &#1089; 3 &#1086;&#1074;&#1080; &#1087;&#1086;&#1083;&#1077;&#1090;&#1072;. &#1055;&#1098;&#1088;&#1074;&#1086;&#1090;&#1086; &#1077; 
&#1079;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1080;&#1103;&#1090;&#1072; &#1082;&#1086;&#1081;&#1090;&#1086; &#1097;&#1077; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1090;. &#1042;&#1089;&#1077;&#1082;&#1080; &#1085;&#1077;&#1075;&#1086;&#1074; &#1073;&#1080;&#1090; &#1086;&#1090;&#1075;&#1086;&#1074;&#1072;&#1088;&#1103; 
&#1085;&#1072; &#1076;&#1072;&#1076;&#1077;&#1085;&#1086; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077;, &#1072; &#1072;&#1082;&#1086; &#1077; &#1085;&#1091;&#1083;&#1072; - &#1079;&#1085;&#1072;&#1095;&#1080; &#1085;&#1103;&#1084;&#1072; &#1090;&#1072;&#1082;&#1086;&#1074;&#1072;. &#1042; &#1076;&#1088;&#1091;&#1075;&#1080;&#1090;&#1077; &#1076;&#1074;&#1077; &#1087;&#1098;&#1082; &#1086;&#1090; 
&#1089;&#1074;&#1086;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1072; &#1089;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1074;&#1072; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072;&#1090;&#1072; &#1082;&#1086;&#1103;&#1090;&#1086; &#1097;&#1077; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1074;&#1072; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086;. 
&#1045;&#1076;&#1080;&#1085;&#1089;&#1074;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1077;, &#1095;&#1077; &#1090;&#1072;&#1089;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1097;&#1077; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103; &#1082;&#1086;&#1077; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077; &#1103; &#1077; 
&#1080;&#1079;&#1074;&#1080;&#1082;&#1072;&#1083;&#1086;, &#1085;&#1086; &#1090;&#1086;&#1074;&#1072; &#1085;&#1077; &#1077; &#1095;&#1072;&#1082; &#1090;&#1086;&#1083;&#1082;&#1086;&#1074;&#1072; &#1079;&#1083;&#1077; :)</span></p>

<p style="margin-top: 0; margin-bottom: 0">&nbsp;</p>

<p style="margin-top: 0; margin-bottom: 0"><span lang="bg">&#1087;.&#1087;: &#1057;&#1098;&#1078;&#1077;&#1083;&#1103;&#1074;&#1072;&#1084; &#1079;&#1072; 
&#1083;&#1086;&#1096;&#1086;&#1090;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; - &#1091;&#1084;&#1086;&#1088;&#1072;&#1090;&#1072; &#1074;&#1077;&#1095;&#1077; &#1085;&#1072;&#1090;&#1076;&#1077;&#1083;&#1103;&#1074;&#1072; :)</span></p>

<p style="margin-top: 0; margin-bottom: 0" align="right"><b><span lang="bg">30 
&#1040;&#1087;&#1088;&#1080;&#1083; 2006</span></b></p>

</body>

</html>