<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
<meta http-equiv="Content-Language" content="en-us">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<title>The^day^of^DooM:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; AVR-OS 0.Xx</title></head>
<body>

<p align="center"><i><font face="Arial"><b><font size="5">AVR</font><font size="5">-OS 
0.Xx (0.73/0.70)</font></b></font></i></p>

<p align="center"><b><i><font face="Arial" size="1">(<a style="text-decoration: none;" href="mailto:the_day_of_doom@abv.bg">the_day_of_doom@abv.bg</a>)</font></i></b></p>
<p style="text-indent: 13px; margin-top: 0pt; margin-bottom: 0pt;" align="left">&#1042; 
&#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1072;&#1090;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1097;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1103; &#1085;&#1072;&#1081;-&#1086;&#1089;&#1085;&#1086;&#1074;&#1077;&#1085; &#1087;&#1088;&#1077;&#1075;&#1083;&#1077;&#1076; &#1085;&#1072; &#1077;&#1076;&#1080;&#1085; &#1084;&#1086;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, AVR-OS, 
&#1087;&#1088;&#1077;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1074;&#1072;&#1097; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1079;&#1072; 8 &#1073;&#1080;&#1090;&#1086;&#1074; &#1084;&#1080;&#1082;&#1088;&#1086;&#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1077;&#1088; (&#1092;&#1072;&#1084;&#1080;&#1083;&#1080;&#1103;&#1090;&#1072; AVR &#1085;&#1072; 
ATMEL, &#1087;&#1086;-&#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1085;&#1086; ATmega16). &#1053;&#1086; &#1087;&#1088;&#1077;&#1076;&#1080; &#1076;&#1072; &#1087;&#1088;&#1086;&#1076;&#1098;&#1083;&#1078;&#1072; &#1085;&#1077;&#1082;&#1072; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1103; &#1077;&#1076;&#1085;&#1086; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086; 
&#1091;&#1090;&#1086;&#1095;&#1085;&#1077;&#1085;&#1080;&#1077; - &#1074;&#1098;&#1087;&#1088;&#1077;&#1082;&#1080;, &#1095;&#1077; &#1097;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1084; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1077;&#1090;&#1086; OS (&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;) &#1090;&#1086;&#1074;&#1072; 
&#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1072; &#1089;&#1080; &#1077; &#1077;&#1076;&#1080;&#1085; kernel &#1089; &#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090; &#1079;&#1072; &#1088;&#1072;&#1079;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;. &#1053;&#1077;&#1075;&#1086;&#1074;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1077; 
&#1076;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080; &#1089;&#1098;&#1089;&#1079;&#1076;&#1072;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086;, &#1091;&#1085;&#1080;&#1097;&#1086;&#1078;&#1072;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1080; 
<span lang="bg">&#1091;</span>&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1077;&#1076;&#1080;&#1085; &#1080;&#1083;&#1080; &#1085;&#1103;&#1082;&#1086;&#1083;&#1082;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072;, 
&#1082;&#1072;&#1090;&#1086; &#1089;&#1098;&#1097;&#1077;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1086; &#1084;&#1086;&#1103;&#1090;&#1072; &#1094;&#1077;&#1083; &#1077; &#1076;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1085;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1089;&#1090;&#1072; &#1082;&#1086;&#1081;&#1090;&#1086; 
&#1075;&#1086; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;.</p>
<p align="left">&nbsp;</p>
<p align="center"><b><span lang="bg">&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;</span></b></p>
<p style="text-indent: 13px; margin-top: 0pt; margin-bottom: 0pt;" align="left">AVR-OS <span lang="bg">
&#1079;&#1072;&#1087;&#1086;&#1095;&#1085;&#1072; &#1086;&#1090; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; 0.1, &#1082;&#1072;&#1090;&#1086; &#1086;&#1073;&#1097;&#1086; &#1074;&#1079;&#1077;&#1090;&#1086; &#1085;&#1103;&#1084;&#1072; &#1085;&#1080;&#1097;&#1086; &#1086;&#1073;&#1097;&#1086; &#1089; &#1090;&#1077;&#1082;&#1091;&#1097;&#1072;&#1090;&#1072; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;. <b>0.1</b> 
&#1077; &#1077;&#1076;&#1085;&#1072; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1085;&#1072; &#1080;&#1079;&#1094;&#1077;&#1087;&#1082;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1089;&#1082;&#1072;&#1090;&#1072; &#1084;&#1080;&#1089;&#1098;&#1083;, &#1082;&#1072;&#1090;&#1086; &#1085;&#1077;&#1081;&#1085;&#1072;&#1090;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072; &#1094;&#1077;&#1083; &#1073;&#1077;&#1096;&#1077; &#1076;&#1072; 
&#1089;&#1077; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1074;&#1103; /&#1086;&#1073;&#1091;&#1095;&#1072;?/ &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1086;&#1103;&#1097;&#1072;&#1090;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;. &#1042; &#1086;&#1073;&#1097;&#1080; &#1083;&#1080;&#1085;&#1080;&#1080; &#1090;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1074;&#1072;&#1096;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1080;&#1090;&#1077; 
&#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080; &#1074;
</span>SRAM <span lang="bg">&#1080; &#1075;&#1080; &#1080;&#1079;&#1074;&#1080;&#1082;&#1074;&#1072;&#1096;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1085;&#1086; &#1082;&#1072;&#1090;&#1086; &#1087;&#1086;&#1074;&#1090;&#1072;&#1088;&#1103;&#1096;&#1077; &#1074;&#1089;&#1077;&#1082;&#1080; 
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1085;&#1077; &#1073;&#1088;&#1086;&#1081; &#1087;&#1098;&#1090;&#1080;, &#1079;&#1072;&#1076;&#1072;&#1076;&#1077;&#1085; &#1086;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1089;&#1090;&#1072;. &#1053;&#1072;&#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1072; &#1090;&#1086;&#1074;&#1072; &#1089;&#1080; &#1073;&#1077;&#1096;&#1077; &#1077;&#1076;&#1080;&#1085; 
&#1091;&#1089;&#1083;&#1086;&#1078;&#1085;&#1077;&#1085; &#1094;&#1080;&#1082;&#1098;&#1083; </span><b>for </b>:) <span lang="bg">&#1057;&#1083;&#1077;&#1076; &#1090;&#1086;&#1074;&#1072; &#1079;&#1072;&#1087;&#1086;&#1095;&#1085;&#1072; &#1089;&#1077;&#1088;&#1080;&#1086;&#1079;&#1085;&#1072;&#1090;&#1072; 
&#1088;&#1072;&#1073;&#1086;&#1090;&#1072; - <b><a href="0.2/index.htm">0.2</a></b>.<b> </b>&#1042;&#1077;&#1095;&#1077; &#1073;&#1077;&#1096;&#1077; &#1086;&#1082;&#1086;&#1087;&#1080;&#1088;&#1072;&#1085; </span>TIMER0 - <span lang="bg">
&#1074;&#1089;&#1077;&#1082;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1088;&#1072;&#1079;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072; &#1089; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085; &#1073;&#1088;&#1086;&#1081; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1080; &#1094;&#1080;&#1082;&#1083;&#1080; &#1089;&#1083;&#1077;&#1076; &#1080;&#1079;&#1090;&#1080;&#1095;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1082;&#1086;&#1080;&#1090;&#1086; &#1089;&#1077; 
&#1087;&#1088;&#1077;&#1084;&#1080;&#1085;&#1072;&#1074;&#1072; &#1082;&#1098;&#1084; &#1089;&#1083;&#1077;&#1076;&#1074;&#1072;&#1097;&#1080;&#1103;. &#1055;&#1086;&#1095;&#1090;&#1080; &#1082;&#1072;&#1090;&#1086; &#1074; <b>0.1 </b>;) 
(<a href="0.3/index.htm">&#1084;&#1072;&#1083;&#1082;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1079;&#1072; <b>0.3</b></a>). &#1053;&#1086; &#1076;&#1086; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; <b>
<a href="0.5/index.htm">0.5</a> </b>
&#1080;&#1084;&#1072;&#1096;&#1077; &#1075;&#1086;&#1083;&#1077;&#1084;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080; &#1089;&#1098;&#1089; &#1079;&#1072;&#1087;&#1072;&#1079;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1085;&#1080;&#1090;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080; - &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1096;&#1077; &#1089;&#1077;
</span>Z <span lang="bg">&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1098;&#1088;&#1072; &#1079;&#1072; &#1076;&#1072; &#1089;&#1077; &#1080;&#1079;&#1074;&#1080;&#1082;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; (</span><b>task</b>)
<span lang="bg">&#1072; &#1090;&#1086;&#1074;&#1072; &#1089;&#1080; &#1073;&#1077;&#1096;&#1077; &#1078;&#1080;&#1074;&#1072; &#1090;&#1088;&#1072;&#1075;&#1077;&#1076;&#1080;&#1103;... 
&#1040; &#1087;&#1088;&#1080; <a href="0.6/0.6.htm">0.6</a> &#1076;&#1091;&#1084;&#1080;&#1090;&#1077; "&#1087;&#1088;&#1086;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1085;&#1086;&#1089;&#1090;", "&#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1086;" &#1085;&#1077; 
&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1074;&#1072;&#1093;&#1072; &#1085;&#1080;&#1097;&#1086;... :) &#1058;&#1091;&#1082;&#1072; &#1077; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1076;&#1072; 
&#1089;&#1080; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1103;, &#1095;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1072; &#1080;&#1084;&#1072; /&#1076;&#1072; &#1074;&#1089;&#1077; &#1086;&#1097;&#1077;/ &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1085;&#1072; &#1090;&#1077;&#1086;&#1088;&#1080;&#1090;&#1080;&#1095;&#1085;&#1072; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1087;&#1086; 
&#1087;&#1080;&#1089;&#1072;&#1085;&#1077; &#1085;&#1072; </span>OS. <span lang="bg">&#1050;&#1072;&#1082;&#1090;&#1086; &#1089;&#1077; &#1082;&#1072;&#1079;&#1074;&#1072; - &#1091;&#1095;&#1072; &#1089;&#1077; &#1074; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077;. &#1057;&#1083;&#1077;&#1076; 
&#1082;&#1072;&#1082;&#1086; &#1089;&#1090;&#1077; &#1087;&#1088;&#1086;&#1095;&#1077;&#1083;&#1080; &#1090;&#1086;&#1074;&#1072; &#1089;&#1080;&#1075;&#1091;&#1088;&#1085;&#1086; &#1089;&#1080; &#1082;&#1072;&#1079;&#1074;&#1072;&#1090;&#1077; '&#1082;&#1072;&#1082;&#1074;&#1086; &#1083;&#1080; &#1089;&#1077; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1074;&#1072;&#1084; &#1089; &#1087;&#1086;&#1088;&#1077;&#1076;&#1085;&#1080;&#1103; 
&#1086;&#1073;&#1088;&#1077;&#1095;&#1077;&#1085; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;?...' &#1080; &#1089;&#1080;&#1075;&#1091;&#1088;&#1085;&#1086; 
&#1080;&#1084;&#1072;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086;. &#1053;&#1086; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1089;&#1077; &#1074;&#1079;&#1077;&#1084;&#1077; &#1074; &#1087;&#1088;&#1077;&#1076;&#1074;&#1080;&#1090; &#1095;&#1077; &#1090;&#1086;&#1074;&#1072;, &#1095;&#1077; &#1074;&#1089;&#1077;&#1082;&#1080; &#1088;&#1077;&#1076; &#1086;&#1090; 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1090;&#1072; &#1077; &#1087;&#1088;&#1072;&#1074;&#1077;&#1085; &#1089; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1090;&#1072; &#1094;&#1077;&#1083; 
&#1077; &#1076;&#1072; &#1053;&#1045; &#1087;&#1088;&#1077;&#1095;&#1080; &#1085;&#1072; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1089;&#1090;&#1072; &#1076;&#1072; &#1089;&#1080; &#1087;&#1080;&#1096;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;&#1090;&#1072; &#1080; &#1089;&#1098;&#1097;&#1077;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1086; &#1076;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1074;&#1072; &#1078;&#1077;&#1083;&#1103;&#1079;&#1086;&#1090;&#1086; &#1085;&#1072; 100% :) 
&#1055;&#1080;&#1089;&#1072;&#1085;&#1072; &#1086;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1089;&#1090; /&#1084;&#1072;&#1083;&#1077;, &#1095;&#1077; &#1089;&#1098;&#1084; &#1089;&#1082;&#1088;&#1086;&#1084;&#1077;&#1085; ;) / &#1079;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1089;&#1090;&#1080; :) &#1053;&#1086; &#1089;&#1090;&#1080;&#1075;&#1072; 
&#1087;&#1088;&#1072;&#1079;&#1085;&#1080; &#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1094;&#1080;, &#1085;&#1077;&#1082;&#1072; &#1087;&#1086;&#1075;&#1083;&#1077;&#1076;&#1085;&#1077;&#1084; &#1087;&#1086;-&#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086; &#1079;&#1072; &#1082;&#1072;&#1082;&#1074;&#1086; &#1080;&#1076;&#1077; &#1088;&#1077;&#1095;. 
&#1047;&#1072;&#1089;&#1077;&#1075;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1090;&#1077; 3 &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1089;&#1072;: <b><a href="html/0.70.htm">0.70</a></b>;&nbsp; <b><a href="html/0.71.htm">0.71</a></b> </span>(<span lang="bg">&#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1085;&#1072;)</span>.
<span lang="bg">&#1053;&#1072; </span><b>26.01.2007</b><span lang="bg"> &#1079;&#1072;&#1087;&#1086;&#1095;&#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1072; &#1087;&#1086; 
&#1074;&#1077;&#1088;&#1089;&#1080;&#1103; <b><a href="html/0.72.htm">0.72</a></b></span><font size="2"><b> </b></font>
(&#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1085;&#1072;;)<span lang="bg"> . &#1057;&#1083;&#1077;&#1076; &#1076;&#1098;&#1083;&#1072;&#1075; &#1079;&#1072;&#1089;&#1090;&#1086;&#1081; &#1085;&#1072; <span style="font-weight: bold;">16.01.2008</span> &#1079;&#1072;&#1087;&#1086;&#1095;&#1085;&#1072;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; <a style="font-weight: bold;" href="html/0.73.htm">0.73</a>. &#1055;&#1088;&#1080; &#1085;&#1077;&#1103; &#1089;&#1072; &#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1085;&#1072;&#1090;&#1080; &#1073;&#1098;&#1075;&#1086;&#1074;&#1077; &#1086;&#1090; &#1089;&#1090;&#1072;&#1088;&#1080;&#1090;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1080; &#1085;&#1072;&#1081;-&#1074;&#1072;&#1078;&#1085;&#1086;&#1090;&#1086;: &#1080;&#1079;&#1094;&#1103;&#1083;&#1086; &#1087;&#1088;&#1077;&#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1084;&#1077;&#1085;&#1080;&#1076;&#1078;&#1098;&#1088; &#1085;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090;&#1090;&#1072;.</span></p>
<p align="left">&nbsp;</p>
<p align="center"><b><span lang="bg">&#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1080; &#1085;&#1072; </span>AVR-OS</b></p>
<p style="text-indent: 13px; margin-top: 0pt; margin-bottom: 0pt;" align="left">&#1044;&#1072; &#1089;&#1077; 
&#1087;&#1088;&#1077;&#1095;&#1080; &#1082;&#1086;&#1083;&#1082;&#1086;&#1090;&#1086; &#1089;&#1077; &#1084;&#1086;&#1078;&#1077; &#1087;&#1086;-&#1084;&#1072;&#1083;&#1082;&#1086; &#1080; &#1089;&#1098;&#1097;&#1077;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1086; &#1076;&#1072; &#1074;&#1098;&#1088;&#1096;&#1080; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1085;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; 
:) &#1045;&#1093;, &#1090;&#1086;&#1074;&#1072; &#1077; &#1087;&#1086;&#1095;&#1090;&#1080; &#1085;&#1077;&#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072; &#1090;&#1086;&#1083;&#1082;&#1086;&#1074;&#1072; &#1084;&#1072;&#1083;&#1098;&#1082; kernel &#1085;&#1086; &#1074;&#1089;&#1077; &#1087;&#1072;&#1082; &#1080;&#1084;&#1072; 
&#1087;&#1088;&#1086;&#1073;&#1083;&#1103;&#1089;&#1098;&#1094;&#1080; &#1080; &#1076;&#1072; &#1089;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;. &#1055;&#1086;&#1088;&#1072;&#1076;&#1080; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1072;&#1090;&#1072; &#1072;&#1088;&#1092;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1089;&#1077; 
&#1085;&#1072;&#1083;&#1072;&#1075;&#1072; &#1082;&#1086;&#1076;&#1072; &#1085;&#1072; OS &#1080; &#1086;&#1090;&#1076;&#1077;&#1083;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080; /&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080;, task/ &#1076;&#1072; &#1089;&#1077; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1072;&#1090; &#1079;&#1072;&#1077;&#1076;&#1085;&#1086;, 
&#1085;&#1072;<span lang="bg"> </span>&#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1072; &#1094;&#1077;&#1083;&#1080;&#1103; kernel &#1089;&#1077; &#1089;&#1074;&#1098;&#1088;&#1079;&#1074;&#1072; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1085;&#1086; &#1089; &#1082;&#1086;&#1076;&#1072; &#1085;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1090;&#1072; &#1074; &#1077;&#1076;&#1080;&#1085; *.hex 
&#1092;&#1072;&#1081;&#1083; &#1082;&#1086;&#1081;&#1090;&#1086; &#1089;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1074;&#1072; &#1074; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1077;&#1088;&#1072;. &#1047;&#1072; &#1076;&#1072; &#1089;&#1077; &#1087;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1077; &#1090;&#1086;&#1074;&#1072; &#1082;&#1086;&#1075;&#1072;&#1090;&#1086; &#1080;&#1079;&#1075;&#1088;&#1072;&#1078;&#1076;&#1072;&#1084;&#1077; 
&#1089;&#1082;&#1077;&#1083;&#1077;&#1090;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;&#1090;&#1072; &#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086;&#1090;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1074;&#1072;&#1084;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1076;&#1077;&#1092;&#1080;&#1085;&#1080;&#1094;&#1080;&#1080; &#1085;&#1072; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1077;&#1088;&#1072; &#1089; 
&#1082;&#1086;&#1081;&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1080;&#1084; &#1089;&#1083;&#1077;&#1076; &#1090;&#1086;&#1074;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1103;&#1084;&#1077; &#1080; &#1092;&#1072;&#1081;&#1083;&#1072; AVR-OS-API.inc, a &#1085;&#1072;&#1082;&#1088;&#1072;&#1103; &#1085;&#1072; &#1082;&#1086;&#1076;&#1072; - 
AVR-OS.inc. &#1058;&#1091;&#1082; &#1077; &#1084;&#1103;&#1089;&#1090;&#1086;&#1090;&#1086; &#1076;&#1072; &#1086;&#1090;&#1073;&#1077;&#1083;&#1077;&#1078;&#1072;, &#1095;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1077;&#1090;&#1077; &#1080;&#1084;&#1072;&#1097;&#1080; &#1074; &#1080;&#1084;&#1077;&#1090;&#1086; &#1089;&#1080; API 
&#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072;&#1090; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1080; &#1079;&#1072; &#1087;&#1086;-&#1091;&#1076;&#1086;&#1073;&#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089;&#1098;&#1089; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1080;&#1090;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;. &#1056;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072; &#1089;&#1077; &#1072;&#1082;&#1086; 
&#1075;&#1086;&#1085;&#1080;&#1084; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1085;&#1072; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090; &#1080; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1077;&#1085; &#1086;&#1073;&#1077;&#1084; &#1077; &#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1085;&#1086; &#1076;&#1072; &#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1084;&#1077; &#1076;&#1080;&#1088;&#1077;&#1090;&#1085;&#1080; 
&#1080;&#1079;&#1074;&#1080;&#1082;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072; &#1092;&#1091;&#1085;&#1082;&#1080;&#1080;&#1090;&#1077; &#1080; &#1085;&#1086; &#1090;&#1086;&#1074;&#1072; &#1076;&#1086;&#1088;&#1080; &#1072;&#1079; &#1085;&#1077; &#1075;&#1086; &#1087;&#1088;&#1072;&#1074;&#1103; /&#1087;&#1088;&#1077;&#1082;&#1072;&#1083;&#1077;&#1085;&#1086; &#1077; &#1088;&#1080;&#1089;&#1082;&#1086;&#1074;&#1086; 
&#1087;&#1086;&#1076;&#1072;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1075;&#1088;&#1077;&#1096;&#1085;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;/. &#1053;&#1086; &#1079;&#1072;&#1097;&#1086; &#1085;&#1072;&#1084;&#1077;&#1089;&#1080;&#1093; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1072; &#1080; &#1086;&#1073;&#1077;&#1084;&#1072;? - &#1072;&#1082;&#1086; 
&#1088;&#1072;&#1075;&#1083;&#1077;&#1076;&#1072;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1090;&#1077; &#1089; API &#1097;&#1077; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1077; &#1090;&#1077; &#1079;&#1072;&#1087;&#1072;&#1079;&#1074;&#1072;&#1090; &#1074;&#1089;&#1080;&#1095;&#1082;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080; /&#1076;&#1072;, 
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1090;&#1077; &#1089;&#1077; &#1087;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090; &#1095;&#1088;&#1077;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1090;&#1077;/ &#1074; &#1089;&#1090;&#1077;&#1082;&#1072;. &#1040; &#1090;&#1086;&#1074;&#1072; &#1077; &#1076;&#1086;&#1087;&#1098;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1077;&#1085; &#1082;&#1086;&#1076;... 
&#1053;&#1086; &#1085;&#1072; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1080; &#1083;&#1080;&#1095;&#1085;&#1086; &#1079;&#1072; &#1084;&#1077;&#1085;&#1077; &#1077; &#1087;&#1086;-&#1091;&#1076;&#1086;&#1073;&#1085;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086; &#1090;&#1072;&#1082;&#1072; :) &#1042;&#1089;&#1098;&#1097;&#1085;&#1086;&#1089;&#1090; &#1082;&#1072;&#1082;&#1074;&#1086; &#1083;&#1080; &#1089;&#1077; 
&#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1074;&#1072;&#1084; &#1089; &#1080;&#1076;&#1077;&#1086;&#1083;&#1086;&#1075;&#1080;&#1103;&#1090;&#1072; &#1080; ? &#1071; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1086; &#1076;&#1072; &#1074; &#1080;&#1084;&#1077;&#1090;&#1085;&#1072; &#1074; &#1076;&#1098;&#1083;&#1073;&#1086;&#1082;&#1086;&#1090;&#1086;, &#1072; &#1080;&#1084;&#1077;&#1085;&#1086;</p>
<p align="left">&nbsp;</p>
<p align="center"><b>&#1050;&#1072;&#1082; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072; AVR-OS &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1090;&#1077; &#1085;&#1080; ?</b></p>
<p align="left"><span lang="bg">&#1065;&#1077; &#1086;&#1090;&#1075;&#1086;&#1074;&#1086;&#1088;&#1103; &#1085;&#1072; &#1090;&#1086;&#1079;&#1080; &#1074;&#1098;&#1087;&#1088;&#1086;&#1089; &#1095;&#1088;&#1077;&#1079; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077;&#1085; &#1082;&#1086;&#1076;:</span></p>
<p style="margin-top: 11px; margin-bottom: 11px;" align="left"><span lang="bg">
<font color="#008080">.include "</font><font color="#ff0000">m16def.inc</font><font color="#008080">"</font><br>
<font color="#008080">.include "</font><font color="#ff0000">0.70/scr/AVR-OS-API.inc</font><font color="#008080">"</font>
<font color="#c0c0c0">//</font> <font color="#c0c0c0">&#1047;&#1072;&#1076;&#1098;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1077;&#1085; &#1088;&#1077;&#1076;</font></span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left"><span lang="bg"><b>
OSCreateTaskC</b> <b>task1</b>, <font color="#00ff00">11</font> </span>&nbsp;<span lang="bg"><font color="#c0c0c0">//</font>
<font color="#c0c0c0">&#1046;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1085;&#1086; &#1077; &#1076;&#1072; &#1089;&#1098;&#1079;&#1076;&#1072;&#1076;&#1077;&#1084; &#1087;&#1086;&#1085;&#1077; &#1077;&#1076;&#1080;&#1085; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;. &#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1085;&#1086; &#1054;&#1057;-&#1072; 
&#1089;&#1080; &#1089;&#1098;&#1079;&#1076;&#1072;&#1074;&#1072; &#1077;&#1076;&#1080;&#1085; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1077;&#1085; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;</font></span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left"><font color="#c0c0c0">
<span lang="bg">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span>&nbsp;&nbsp;&nbsp; <span lang="bg">// &#1085;&#1086; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1077; &#1079;&#1072;&#1073;&#1088;&#1072;&#1085;&#1080; &#1086;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072;
</span><a href="0.70/scr/AVR-OS-API.inc">avr-os-api.inc</a> <span lang="bg">&#1095;&#1088;&#1077;&#1079; 
&#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1088;&#1077;&#1076;&#1072; <b>#define DISPLAY</b></span></font></p>
<p style="margin-top: 11px; margin-bottom: 0pt;" align="left"><b><span lang="bg">
OSInit&nbsp;&nbsp;&nbsp;&nbsp; // &#1047;&#1072;&#1076;&#1098;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1077;&#1085; &#1088;&#1077;&#1076;. &#1048;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;&#1090;&#1072; &#1085;&#1072; 
&#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; </span>OS</b></p>
<p style="margin-top: 0pt; margin-bottom: 11px;" align="left"><b>OSRun<span lang="bg">&nbsp;&nbsp;&nbsp; 
//</span> <span lang="bg">&#1047;&#1072;&#1076;&#1098;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1077;&#1085; &#1088;&#1077;&#1076;</span>. <span lang="bg">&#1057;&#1090;&#1072;&#1088;&#1090;&#1080;&#1088;&#1072; 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1090;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;</span></b></p>
<p style="margin-top: 0pt; margin-bottom: 11px;" align="left"><font color="#008080">
.include "</font><font color="#ff0000">0.70/scr/AVR-OS.inc</font><font color="#008080">"</font><span lang="bg">
<font color="#c0c0c0">// &#1047;&#1072;&#1076;&#1098;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1077;&#1085; &#1088;&#1077;&#1076;</font></span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left"><b>task1</b>:</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left"><font color="#0000ff">
nop</font></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left"><b>OSExit</b></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p align="center"><b><span lang="bg">&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1085;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1090;</span>a</b></p>
<p style="text-indent: 13px; margin-top: 0pt; margin-bottom: 0pt;" align="left">&#1055;&#1098;&#1088;&#1074;&#1086;<span lang="bg"> 
&#1097;&#1077; &#1079;&#1072;&#1087;&#1086;&#1095;&#1085;&#1072; &#1086;&#1090; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;&#1090;&#1077; &#1074; &#1082;&#1086;&#1080;&#1090;&#1086; &#1089;&#1072; &#1088;&#1072;&#1079;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1077;&#1090;&#1077; &#1080;:</span></p>
<p style="text-indent: 13px; margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left"><b>user_dir</b><span lang="bg">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span>/<span lang="bg">&nbsp; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1103;&#1090;&#1072; &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; /</span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">|</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">|__ <b>bin</b><span lang="bg">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span>/<span lang="bg"> &#1090;&#1091;&#1082;&#1072; &#1089;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1074;&#1072; &#1080;&#1079;&#1093;&#1086;&#1076;&#1085;&#1080;&#1103; *.</span>hex <span lang="bg">
&#1092;&#1072;&#1081;&#1083; /</span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">|</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">|__ <b>scr</b></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;&nbsp;&nbsp; |</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;&nbsp;&nbsp; |__
<b>kernel</b><span lang="bg">&nbsp;&nbsp;&nbsp; / &#1103;&#1076;&#1088;&#1086;&#1090;&#1086; &#1085;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1090;&#1072;, 
 
&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080;, &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; /</span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;&nbsp;&nbsp; |&nbsp;&nbsp; 
|__ <b>api<span lang="bg">&nbsp;&nbsp;&nbsp; / </span></b><span lang="bg">
&#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1080; &#1079;&#1072; &#1087;&#1086;-&#1091;&#1076;&#1086;&#1073;&#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1103;&#1076;&#1088;&#1086;&#1090;&#1086; /</span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;&nbsp;&nbsp; |</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;&nbsp;&nbsp; |__
<b>lib</b></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;&nbsp;&nbsp; |&nbsp;&nbsp; 
|__ <b>delay</b><span lang="bg">&nbsp;&nbsp;&nbsp; / &#1089;&#1098;&#1074;&#1089;&#1077;&#1084; &#1086;&#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1085;&#1072; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; 
&#1079;&#1072; '&#1079;&#1072;&#1082;&#1098;&#1089;&#1085;&#1077;&#1085;&#1080;&#1103;' &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1085;&#1072; &#1086;&#1090; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072; &#1085;&#1072; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1103; /</span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;&nbsp;&nbsp; |</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;&nbsp;&nbsp; |__
<b>drivers&nbsp;&nbsp;&nbsp; / </b><span lang="bg">&#1090;&#1091;&#1082;&#1072; &#1089;&#1077; &#1087;&#1072;&#1079;&#1103;&#1090; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072;
</span>I/O <span lang="bg">&#1091;&#1089;&#1090;&#1088;&#1086;&#1080;&#1089;&#1090;&#1074;&#1072; /</span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left"><span lang="bg">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span>|__ <b>display</b><span lang="bg">&nbsp;&nbsp;&nbsp; </span>/<span lang="bg"> 
&#1076;&#1074;&#1072; &#1085;&#1077;&#1076;&#1086;&#1074;&#1098;&#1088;&#1096;&#1077;&#1085;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1103;&#1097;&#1080; &#1091;&#1078; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1077;&#1085; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; /</span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
|__ <b>jm162a</b><span lang="bg">&nbsp;&nbsp;&nbsp; / &#1087;&#1098;&#1088;&#1074;&#1080;&#1103; &#1084;&#1080; </span>LCD
<span lang="bg">&#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081; :) /</span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt; text-indent: 13px;" align="left">&#1055;&#1086;&#1085;&#1077;&#1078;&#1077; 
&#1079;&#1072;&#1089;&#1077;&#1075;&#1072; &#1088;&#1072;&#1079;&#1075;&#1083;&#1077;&#1078;&#1076;&#1072;&#1084;&#1077; &#1103;&#1076;&#1088;&#1086;&#1090;&#1086; &#1085;&#1072; &#1054;&#1057;-&#1072; &#1079;&#1072; &#1085;&#1072;&#1089; &#1085;&#1072;&#1081;-&#1074;&#1072;&#1078;&#1085;&#1086; &#1077; &#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;&#1090;&#1086; &#1085;&#1072; 
&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1103;&#1090;&#1072; kernel &#1080; &#1087;&#1086;&#1090;&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1103;&#1090;&#1072; &#1080; api. &#1040; &#1090;&#1086; &#1077; &#1089;&#1083;&#1077;&#1076;&#1085;&#1086;&#1090;&#1086;:</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left"><span lang="bg">&#1047;&#1072;
</span>/<b>kernel</b>:</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">
<a href="0.70/0.70/scr/kernel/irq.inc">irq.inc</a></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">
<a href="0.70/0.70/scr/kernel/message.inc">message.inc</a></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">
<a href="0.70/0.70/scr/kernel/task.inc">task.inc</a></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">
<a href="0.70/0.70/scr/kernel/timer.inc">timer.inc</a></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left"><span lang="bg">&#1080; 
&#1089;&#1098;&#1086;&#1090;&#1074;&#1077;&#1090;&#1085;&#1086; &#1079;&#1072; </span><b>
kernel/api</b><span lang="bg">:</span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">
<a href="0.70/0.70/scr/kernel/api/irq-api.inc">irq<span lang="bg">-</span>api.inc</a></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">
<a href="0.70/scr/kernel/api/message-api.inc">message-api.inc</a></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">
<a href="0.70/scr/kernel/api/task-api.inc">task-api.inc</a></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">
<a href="0.70/scr/kernel/api/timer-api.inc">timer-api.inc</a></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="center"><b>AVR-OS Kernel</b></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt; text-indent: 13px;" align="left">&#1052;&#1080;&#1089;&#1083;&#1103; 
&#1079;&#1072;&#1089;&#1077;&#1075;&#1072; &#1076;&#1072; &#1085;&#1072;&#1073;&#1083;&#1077;&#1075;&#1085;&#1072; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1085;&#1072; &#1103;&#1076;&#1088;&#1086;&#1090;&#1086;. &#1050;&#1086;&#1075;&#1072;&#1090;&#1086; &#1089;&#1098;&#1079;&#1076;&#1072;&#1074;&#1072;&#1084;&#1077; &#1085;&#1086;&#1074; 
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1090;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072; &#1073;&#1088;&#1086;&#1103; &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080;, &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1072;&#1074;&#1072; &#1075;&#1086; &#1089; 1, 
&#1080;&#1079;&#1095;&#1080;&#1089;&#1083;&#1103;&#1074;&#1072; &#1086;&#1090;&#1084;&#1077;&#1089;&#1090;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1074; SRAM &#1082;&#1098;&#1076;&#1077;&#1090;&#1086; &#1097;&#1077; &#1089;&#1077; &#1079;&#1072;&#1087;&#1080;&#1096;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;&#1090;&#1072; &#1079;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072;. &#1040; 
&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;&#1090;&#1072; &#1074; &#1086;&#1073;&#1097;&#1080; &#1083;&#1080;&#1085;&#1080;&#1080; &#1077;: &#1089;&#1090;&#1077;&#1082;&#1086;&#1074;
<span lang="bg">&#1091;</span>&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;, &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1086;&#1088;&#1085;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1085;&#1080;&#1090;&#1077; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072;, &#1089;&#1090;&#1077;&#1082;&#1072; &#1084;&#1091;, &#1087;&#1086;&#1097;&#1077;&#1085;&#1089;&#1082;&#1072; &#1082;&#1091;&#1090;&#1080;&#1103;, &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1079;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; 
&#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1080;&#1103;&#1090;&#1072;,
<b>SREG</b> (&#1086;&#1073;&#1097;&#1086; 
<b>100</b>-&#1085;&#1072; &#1073;&#1072;&#1081;&#1090;&#1072; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;, &#1087;&#1088;&#1080; 
<b>1KB</b> &#1089;&#1088;&#1072;&#1084; &#1080;&#1084;&#1072;&#1084;&#1077; &#1084;&#1072;&#1082;&#1089;. &#1086;&#1082;&#1086;&#1083;&#1086; 
<b>11 &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072;</b>). &#1055;&#1088;&#1080; &#1079;&#1072;&#1088;&#1077;&#1078;&#1076;&#1072;&#1077;&#1085; &#1085;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1090;&#1072;, &#1090;&#1103; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1103; &#1073;&#1088;&#1086;&#1080; &#1085;&#1072; 
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080;&#1090;&#1077; &#1080; &#1072;&#1082;&#1086; &#1077; 0 &#1080;&#1079;&#1087;&#1072;&#1076;&#1072; &#1074; crash &#1076;&#1086;&#1082;&#1072;&#1090;&#1086; &#1073;&#1098;&#1076;&#1077; &#1089;&#1098;&#1079;&#1076;&#1072;&#1076;&#1077;&#1085; &#1087;&#1086;&#1085;&#1077; &#1077;&#1076;&#1080;&#1085; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;. &#1053;&#1077;&#1082;&#1072; 
&#1089;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1084;, &#1095;&#1077; &#1080;&#1084;&#1072;&#1084;&#1077; &#1089;&#1098;&#1079;&#1076;&#1072;&#1076;&#1077;&#1085;&#1080; &#1076;&#1074;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072;: task1 &#1080; task2. &#1055;&#1088;&#1080; &#1087;&#1098;&#1088;&#1074;&#1086;&#1090;&#1086; &#1089;&#1080; 
&#1089;&#1090;&#1072;&#1088;&#1090;&#1080;&#1088;&#1072;&#1085;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1090;&#1072; &#1097;&#1077; &#1086;&#1090;&#1080;&#1076;&#1077; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1072; &#1089;&#1098;&#1089; &#1079;&#1072;&#1088;&#1077;&#1078;&#1076;&#1072;&#1077;&#1085; &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1103; 
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;, task1, &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1081;&#1082;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1085;&#1086;&#1090;&#1086; &#1084;&#1091; &#1074;&#1088;&#1077;&#1084;&#1077; &#1074; TIMER0, &#1085;&#1072;&#1089;&#1086;&#1095;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; SP &#1082;&#1098;&#1084; 
&#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1103; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1080; &#1076;.&#1088;. &#1057;&#1083;&#1077;&#1076; &#1082;&#1072;&#1090;&#1086; &#1089;&#1077; &#1089;&#1090;&#1072;&#1088;&#1090;&#1080;&#1088;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1089;&#1077; &#1080;&#1079;&#1095;&#1072;&#1082;&#1074;&#1072; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; 
&#1079;&#1072; &#1085;&#1072; &#1090;&#1072;&#1081;&#1084;&#1077;&#1088;&#1072; &#1087;&#1088;&#1080; &#1082;&#1086;&#1077;&#1090;&#1086; &#1097;&#1077; &#1089;&#1077; &#1079;&#1072;&#1087;&#1072;&#1079;&#1080; &#1089;&#1098;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1090;&#1077; &#1084;&#1091;, &#1089;&#1090;&#1077;&#1082;&#1086;&#1074;&#1080;&#1103; &#1084;&#1091;
<span lang="bg">&#1091;</span>&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083; &#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1080;&#1080;&#1082;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;&#1090;&#1072; &#1079;&#1072; task2 (&#1089;&#1098;&#1097;&#1072;&#1090;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1082;&#1072;&#1090;&#1086; task1). 
&#1053;&#1072;&#1082;&#1088;&#1072;&#1090;&#1082;&#1086; - &#1085;&#1077;&#1081;&#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1077; &#1076;&#1072; '&#1074;&#1098;&#1088;&#1090;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080;&#1090;&#1077;, &#1079;&#1072;&#1087;&#1072;&#1079;&#1074;&#1072;&#1081;&#1082;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1090;&#1077; &#1080;&#1084;, 
&#1087;&#1088;&#1077;&#1085;&#1072;&#1089;&#1086;&#1095;&#1074;&#1072;&#1081;&#1082;&#1080; SP &#1085;&#1072; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1077;&#1088;&#1072; &#1082;&#1098;&#1084; SP &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1080; &#1079;&#1072;&#1088;&#1077;&#1078;&#1076;&#1072;&#1077;&#1085; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086;&#1074;&#1080;&#1090;&#1077; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;. &#1042;&#1089;&#1098;&#1097;&#1085;&#1086;&#1089;&#1090; &#1085;&#1077;&#1097;&#1086; &#1085;&#1077; &#1084;&#1077; &#1073;&#1080;&#1074;&#1072; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1086; &#1074; &#1086;&#1073;&#1077;&#1089;&#1085;&#1077;&#1085;&#1080;&#1103;&#1090;&#1072; &#1072;&#1084;&#1072;... :) <span lang="bg">
&#1050;&#1072;&#1082;&#1090;&#1086; &#1089;&#1077; &#1074;&#1080;&#1078;&#1076;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1090;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1085;&#1072; &#1103;&#1076;&#1088;&#1086;&#1090;&#1086; &#1077; &#1076;&#1072; &#1087;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1074;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080; &#1080; 
&#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1103;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1080;&#1089; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1074;&#1072;&#1097; &#1087;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1098;&#1079;&#1076;&#1072;&#1074;&#1072;&#1085;&#1077;, 
&#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1074;&#1072;&#1085;&#1077;, &#1080;&#1079;&#1093;&#1086;&#1076; &#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1080;&#1103;&#1090;&#1072;.</span></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="center"><b>AVR-OS API</b></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt; text-indent: 13px;" align="left"><b>
OSCreateTaskC</b> - &#1085;&#1086; &#1087;&#1098;&#1088;&#1074;&#1086; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1103; &#1077;&#1076;&#1085;&#1086; &#1091;&#1090;&#1086;&#1095;&#1085;&#1077;&#1085;&#1080;&#1077;
<b><span lang="bg">- </span>C</b> &#1085;&#1072;&#1082;&#1088;&#1072;&#1103; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1074;&#1072; &#1095;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1080;&#1090;&#1077; &#1089;&#1077; &#1087;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090; &#1082;&#1072;&#1090;&#1086; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1080;, &#1072;&#1082;&#1086; &#1085;&#1103;&#1084;&#1072; 
&#1073;&#1091;&#1082;&#1074;&#1072; &#1090;&#1086; &#1090;&#1077; &#1089;&#1072; &#1082;&#1072;&#1090;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;, &#1072; &#1072;&#1082;&#1086; &#1089;&#1072; &#1089;&#1084;&#1077;&#1089;&#1077;&#1085;&#1080; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072; &#1086;&#1089;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090; &#1088;&#1086;&#1076;&#1072; &#1085;&#1072; <b>
CR</b> (&#1087;&#1098;&#1088;&#1074;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1098;&#1088; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1072;, &#1074;&#1090;&#1086;&#1088;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1098;&#1088;). &#1056;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072; &#1089;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;<span lang="bg">&#1089;</span>&#1072; &#1087;&#1088;&#1080;&#1077;&#1084;&#1072; 
&#1080;&#1084;&#1077;&#1090;&#1086; &#1085;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1090;&#1072; &#1085;&#1086; &#1079;&#1072; &#1076;&#1072; &#1089;&#1077; &#1087;&#1088;&#1077;&#1074;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1072;&#1082;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1077;&#1090;&#1077; &#1089;&#1098;&#1084; &#1087;&#1088;&#1080;&#1077;&#1083;, &#1095;&#1077;
<span lang="bg">&#1092;</span>&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;&#1090;&#1077; &#1079;&#1072;&#1074;&#1098;&#1088;&#1096;&#1074;&#1072;&#1090; &#1089;
<b>F</b> (&#1074; &#1089;&#1083;&#1091;&#1095;&#1077;&#1103; <b>OSCreateTaskF</b>). &#1057;&#1083;&#1077;&#1076; &#1091;&#1090;&#1086;&#1095;&#1085;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086;: &#1090;&#1086;&#1079;&#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1087;&#1088;&#1080;&#1077;&#1084;&#1072; 
&#1079;&#1072; &#1087;&#1098;&#1088;&#1074;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1098;&#1088; &#1080;&#1084;&#1077;&#1090;&#1086; (<b>label</b>) &#1085;&#1072; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;, &#1072; &#1079;&#1072; &#1074;&#1090;&#1086;&#1088;&#1080; &#1095;&#1080;&#1089;&#1083;&#1086; &#1086;&#1090; 
<b>10</b> &#1076;&#1086; <b>255</b> (&#1073;&#1088;&#1086;&#1103; &#1084;&#1072;&#1096;&#1080;&#1080;&#1085;&#1080; &#1094;&#1080;&#1082;&#1083;&#1080; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072;).</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt; text-indent: 13px;" align="left"><b>
OSRemoveTaskByNumberC</b> - &#1079;&#1072; &#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;. &#1048;&#1079;&#1074;&#1080;&#1082;&#1074;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1072;&#1090;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; 
<b>OSRemoveTaskF</b>, &#1079;&#1072;&#1088;&#1077;&#1078;&#1076;&#1072;&#1080;&#1082;&#1080;
<b>R16</b> &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1082;&#1086;&#1081;&#1090;&#1086; &#1078;&#1077;&#1083;&#1072;&#1077;&#1084; &#1076;&#1072; &#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1085;&#1077;&#1084;.</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt; text-indent: 13px;" align="left"><b>
OSAddIRQToTaskC</b> - &#1087;&#1098;&#1088;&#1074;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1098;&#1088; &#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1082;&#1098;&#1084; &#1082;&#1086;&#1081;&#1090;&#1086; &#1097;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1084; 
&#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086;, &#1074;&#1090;&#1086;&#1088;&#1080;&#1103; &#1077; &#1080;&#1077;&#1084;&#1090;&#1086; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1090;&#1086; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077;, &#1072; &#1090;&#1088;&#1077;&#1090;&#1080;&#1103; &#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072;&#1090;&#1072; &#1082;&#1086;&#1103;&#1090;&#1086; 
&#1097;&#1077; &#1075;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1080;. &#1047;&#1072;&#1076;&#1098;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1085;&#1086; &#1077; &#1080;&#1079;&#1093;&#1086;&#1076;&#1072; &#1086;&#1090; &#1085;&#1077;&#1103; &#1076;&#1072; &#1077;&nbsp;
<b>ret</b>/<b>reti</b>. &#1047;&#1072; &#1084;&#1086;&#1084;<span lang="bg">&#1077;</span>&#1085;&#1090;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1072; &#1079;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1080;&#1103;&#1090;&#1072; 
&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1074;&#1072; &#1074;&#1089;&#1077;&#1082;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1076;&#1072; &#1080;&#1084;&#1072; &#1079;&#1072;&#1082;&#1072;&#1095;&#1077;&#1085;&#1086; &#1082;&#1098;&#1084; &#1085;&#1077;&#1075;&#1086; &#1089;&#1072;&#1084;&#1086; &#1077;&#1076;&#1085;&#1086; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077; (&#1080;&#1083;&#1080; 
&#1087;&#1086;-&#1090;&#1086;&#1095;&#1085;&#1086; &#1077;&#1076;&#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1079;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1080;&#1084;) - &#1090;&#1086;&#1074;&#1072; &#1077; &#1077;&#1076;&#1085;&#1072; &#1085;&#1077;&#1076;&#1086;&#1080;&#1079;&#1095;&#1080;&#1089;&#1090;&#1077;&#1085;&#1072; &#1086;&#1090; 
&#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1098;&#1094;&#1080; &#1095;&#1072;&#1089;&#1090; &#1085;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1090;&#1072;. &#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;&#1090;&#1072; &#1077;, &#1095;&#1077; &#1087;&#1086;&#1074;&#1077;&#1095;&#1077;&#1090;&#1086; &#1086;&#1090; &#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1080;&#1103;&#1090;&#1072; 
&#1074;&#1086;&#1076;&#1103;&#1090; &#1089;&#1083;&#1077;&#1076; &#1089;&#1077;&#1073;&#1077; &#1089;&#1080; &#1084;&#1085;&#1086;&#1075;&#1086; &#1075;&#1083;&#1072;&#1074;&#1086;&#1073;&#1086;&#1083;&#1080;&#1103; &#1082;&#1086;&#1080;&#1090;&#1086; &#1079;&#1072; &#1084;&#1086;<span lang="bg">&#1084;</span>&#1077;&#1084;&#1085;&#1090;&#1072; &#1085;&#1077; &#1084;&#1080; &#1089;&#1077; &#1084;&#1080;&#1089;&#1083;&#1080; &#1082;&#1072;&#1082; &#1097;&#1077; &#1075;&#1080; 
&#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1084;... &#1044;&#1086;&#1073;&#1088;&#1072;&#1090;&#1072; &#1085;&#1086;&#1074;&#1080;&#1085;&#1072; &#1077;, &#1095;&#1077; &#1077; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1090;&#1077;&#1083;&#1085;&#1086; &#1083;&#1077;&#1089;&#1077;&#1085; &#1084;&#1086;&#1076;&#1091;&#1083; &#1079;&#1072; &#1088;&#1077;&#1076;&#1072;&#1082;&#1094;&#1080;&#1103;. &#1056;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072; 
&#1089;&#1077; &#1087;&#1080;&#1087;&#1072;&#1085;&#1077;&#1090;&#1086; &#1087;&#1086; &#1085;&#1077;&#1075;&#1086; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1076;&#1086;&#1074;&#1077;&#1076;&#1077; &#1076;&#1086; &#1087;&#1098;&#1083;&#1077;&#1085; crash &#1085;&#1072; &#1054;&#1057; &#1085;&#1086; &#1097;&#1077; &#1073;&#1098;&#1076;&#1077; &#1076;&#1086;&#1080;&#1079;&#1087;&#1080;&#1087;&#1072;&#1085;<span lang="bg">
</span>&#1074; 
&#1089;&#1082;&#1086;&#1088;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077; ;)</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt; text-indent: 13px;" align="left"><b>
OSExit</b> - &#1079;&#1072; &#1080;&#1079;&#1093;&#1086;&#1076; &#1086;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1072;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;. 
&#1054;&#1089;&#1074;&#1077;<span lang="bg">&#1085;</span> &#1080;&#1079;&#1093;&#1086;&#1076; &#1090;&#1086;&#1081; &#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1074;&#1072; &#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; 
&#1086;&#1090; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;&#1090;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080;&#1090;&#1077;. &#1048;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1090;&#1072; OSRemoveTaskF &#1082;&#1072;&#1090;&#1086; &#1089;&#1083;&#1077;&#1076; 
&#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1076;&#1072;&#1076;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1080;&#1079;&#1087;&#1088;&#1072;&#1097;&#1072; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1090;&#1072;, &#1095;&#1077; &#1077; &#1073;&#1080;&#1083;&#1086; 
&#1080;&#1079;&#1074;&#1098;&#1088;&#1096;&#1088;&#1085;&#1086; &#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; (&#1094;&#1077;&#1083;&#1090;&#1072; &#1077; &#1076;&#1072; &#1087;&#1088;&#1086;<span lang="bg">&#1087;</span>&#1091;&#1089;&#1085;&#1077; &#1079;&#1072;&#1087;&#1079;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1072;&#1090;&#1072; &#1084;&#1091; 
&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1082;&#1086;&#1103;&#1090;&#1086; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1097;&#1077; &#1089;&#1077; &#1087;&#1088;&#1077;&#1079;&#1072;&#1087;&#1080;&#1096;&#1077; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1079;&#1072;&#1077;&#1083; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103;&#1090;&#1072; &#1084;&#1091; &#1074; 
&#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;&#1090;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080;&#1090;&#1077;)</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt; text-indent: 13px;" align="left"><b>
OSSendMessage</b>(<b>C</b>) - &#1087;&#1098;&#1088;&#1074;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1098;&#1088; &#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1085;&#1072; &#1082;&#1086;&#1081;&#1090;&#1086; &#1097;&#1077; &#1080;&#1079;&#1087;&#1088;&#1072;&#1097;&#1072;&#1084;&#1077; 
&#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1072; &#1074;&#1090;&#1086;&#1088;&#1080;&#1103; &#1077; &#1089;&#1072;&#1084;&#1086;&#1090;&#1086; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;. &#1048;&#1079;&#1074;&#1080;&#1082;&#1072;&#1074;&#1072; &#1089;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1090;&#1072;
<b>OSSendMessageF</b> &#1082;&#1086;&#1103;&#1090;&#1086; &#1085;&#1072;&#1084;&#1080;&#1088;&#1072; &#1087;&#1086;&#1097;&#1077;&#1085;&#1089;&#1082;&#1072;&#1090;&#1072; &#1082;&#1091;&#1090;&#1080;&#1103; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1085;&#1072; &#1082;&#1086;&#1081;&#1090;&#1086; &#1097;&#1077; 
&#1080;&#1079;&#1087;&#1088;&#1072;&#1097;&#1072;&#1084;&#1077; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086; &#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1074;&#1072; &#1089;&#1072;&#1084;&#1086;&#1090;&#1086; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1080; &#1082;&#1086;&#1080; &#1077; &#1087;&#1086;&#1076;&#1072;&#1090;&#1077;&#1083;&#1103; :)</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt; text-indent: 13px;" align="left"><b>
&#1054;&#1057;ReadMessage</b> - &#1087;&#1098;&#1088;&#1074;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1098;&#1088; &#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1098;&#1088;&#1072; &#1074; &#1082;&#1086;&#1080;&#1090;&#1086; &#1097;&#1077; &#1079;&#1072;&#1087;&#1080;&#1096;&#1077;&#1084; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086; 
&#1072; &#1074;&#1090;&#1086;&#1088;&#1080;&#1103; &#1077; &#1088;&#1077;&#1075;&#1098;&#1089;&#1090;&#1098;&#1088;&#1072; &#1085;&#1072; &#1074; &#1082;&#1086;&#1080;&#1090;&#1086; &#1097;&#1077; &#1079;&#1072;&#1087;&#1080;&#1096;&#1077;&#1084; &#1082;&#1086;&#1080; &#1077; &#1073;&#1080;&#1083; &#1087;&#1086;&#1076;&#1072;&#1090;&#1077;&#1083;.</p>
<p style="text-indent: 13px; margin-top: 0pt; margin-bottom: 0pt;" align="left">&nbsp;</p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="center"><b>&#1055;&#1088;&#1077;&#1075;&#1083;&#1077;&#1076; &#1085;&#1072; &#1085;&#1080;&#1089;&#1082;&#1086; 
&#1085;&#1080;&#1074;&#1086;</b></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;" align="center"><span lang="bg">(!!!
<b><font size="2">&#1080;&#1084;&#1072; &#1088;&#1072;&#1079;&#1084;&#1080;&#1085;&#1072;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; 0.70</font></b> !!!)</span></p>
<p><span lang="bg">&#1058;&#1086;&#1074;&#1072; &#1077; &#1084;&#1086;&#1078;&#1077; &#1073;&#1080; &#1085;&#1072;&#1081;-&#1090;&#1088;&#1091;&#1076;&#1085;&#1072;&#1090;&#1072; &#1075;&#1083;&#1072;&#1074;&#1072; &#1074; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;&#1090;&#1086;. &#1058;&#1091;&#1082;&#1072; &#1097;&#1077; 
&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1103; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1085;&#1080;&#1090;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1085;&#1072; &#1103;&#1076;&#1088;&#1086;&#1090;&#1086;. &#1065;&#1077; &#1087;&#1088;&#1077;&#1075;&#1083;&#1077;&#1076;&#1072;&#1084;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1077;&#1090;&#1077; 
&#1084;&#1091; &#1085;&#1086; &#1085;&#1077;&#1082;&#1072; &#1086;&#1090;&#1086;&#1095;&#1085;&#1072; - &#1087;&#1088;&#1077;&#1075;&#1083;&#1077;&#1076;&#1072; &#1089;&#1090;&#1072;&#1074;&#1072; &#1086;&#1090;&#1079;&#1072;&#1076; &#1085;&#1072;&#1087;&#1088;&#1077;&#1076; - &#1082;&#1086;&#1083;&#1082;&#1086;&#1090;&#1086; &#1087;&#1086;-'&#1085;&#1072;&#1076;&#1086;&#1083;&#1086;' &#1074; &#1092;&#1072;&#1081;&#1083;&#1072; &#1077; 
&#1077;&#1076;&#1085;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1090;&#1086;&#1083;&#1082;&#1086;&#1074;&#1072; &#1087;&#1086;- &#1074;&#1072;&#1078;&#1085;&#1072; &#1077; &#1079;&#1072; &#1054;&#1057; &#1080; &#1096;&#1072;&#1085;&#1089;&#1072; &#1076;&#1072; &#1089;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1080; &#1089; &#1085;&#1077;&#1103; &#1085;&#1072; 
&#1087;&#1086;&#1090;&#1088;&#1073;&#1080;&#1090;&#1077;&#1083;&#1089;&#1082;&#1086; &#1085;&#1080;&#1074;&#1086; &#1085;&#1072;&#1084;&#1072;&#1083;&#1103;&#1074;&#1072;. &#1053;&#1086; &#1085;&#1077;&#1082;&#1072; &#1079;&#1072;&#1087;&#1086;&#1095;&#1085;&#1072;&#1084; &#1087;&#1088;&#1077;&#1075;&#1083;&#1077;&#1076;&#1072; ;) &#1047;&#1072; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086;:</span></p>
<p style="text-indent: 33px;"><font size="4"><a href="0.70/scr/kernel/task.inc">task.inc</a></font> 
(<a href="html/task_help.htm">help</a>)</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>
OSGetDisplacementOfTaskF:</b>&nbsp;&nbsp;&nbsp; <span lang="bg">- &#1047;&#1072; &#1085;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077; &#1085;&#1072; 
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1074; </span><b>SRAM</b></p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>&nbsp;&nbsp;&nbsp; 
R16</b> - &#1085;&#1086;&#1084;e&#1088;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072;</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>&nbsp;&nbsp;&nbsp; 
return:</b></p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
Z</b> - &#1086;&#1090;&#1084;&#1077;&#1089;&#1090;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1084;&#1091; &#1074; <b>SRAM</b></p>
<p style="margin-top: 0pt; margin-bottom: 0pt;">&nbsp;</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>OSRemoveTaskF:</b><span lang="bg">&nbsp;&nbsp;&nbsp; 
- &#1047;&#1072; &#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1087;&#1086; &#1087;&#1086;&#1076;&#1072;&#1076;&#1077;&#1085; &#1085;&#1086;&#1084;&#1077;&#1088;</span></p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>&nbsp;&nbsp;&nbsp; 
R16</b> - &#1085;&#1086;&#1084;&#1077;&#1088;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1082;&#1086;&#1080;&#1090;&#1086; &#1078;&#1077;&#1083;&#1072;&#1077;&#1084; &#1076;&#1072; &#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1085;&#1077;&#1084;.</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;">&nbsp;</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>OSCreateTaskF:</b>&nbsp;&nbsp;&nbsp; 
- <span lang="bg">&#1047;&#1072; &#1089;&#1098;&#1079;&#1076;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;</span></p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>&nbsp;&nbsp;&nbsp; 
X</b> - &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072;</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>&nbsp;&nbsp;&nbsp; 
Y</b> - &#1073;&#1088;&#1086;&#1103; &#1084;&#1072;&#1096;&#1080;&#1085;&#1080; &#1094;&#1080;&#1082;&#1083;&#1080; &#1089; &#1082;&#1086;&#1080;&#1090;&#1086; &#1088;&#1072;&#1079;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;">&nbsp;</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>OSTaskManagerF:</b>&nbsp;&nbsp;&nbsp; 
- &#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1090;&#1072; '&#1079;&#1072;&#1082;&#1072;&#1095;&#1077;&#1085;&#1072;' &#1082;&#1098;&#1084; TIMER0 &#1075;&#1088;&#1080;&#1078;&#1077;&#1097;&#1072; &#1089;&#1077; &#1079;&#1072; &#1089;&#1098;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086;, &#1079;&#1072;&#1088;&#1072;&#1078;&#1076;&#1072;&#1085;&#1077;&#1090;&#1086; &#1080; 
&#1087;&#1088;&#1077;&#1074;&#1082;&#1083;&#1102;&#1095;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1085;&#1080;&#1090;&#1077; <span lang="bg">&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080;.</span></p>

<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;">&nbsp;</p>
<p style="text-indent: 33px;">
<a href="0.70/scr/kernel/message.inc"><font size="4">message.inc</font></a></p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>OSReadMessageF:</b>&nbsp;&nbsp;&nbsp; 
- &#1055;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086; &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>return:<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R16</b> - &#1055;&#1088;&#1086;&#1095;&#1077;&#1090;&#1077;&#1085;&#1086;&#1090;&#1086; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><b>&nbsp;&nbsp;&nbsp;&nbsp; 
R17</b> - &#1053;&#1086;&#1084;&#1077;&#1088;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1082;&#1086;&#1081;&#1090;&#1086; &#1075;&#1086; &#1077; &#1080;&#1079;&#1087;&#1088;&#1072;&#1090;&#1080;&#1083;</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><br>
<b>&nbsp;&nbsp;&nbsp; OSSendMessageToTaskF:</b>&nbsp;&nbsp;&nbsp; -
<span lang="bg">&#1048;&#1079;&#1087;&#1088;&#1072;&#1097;&#1072; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;</span><br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b>R16</b> - &#1055;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072; &#1085;&#1072; &#1082;&#1086;&#1081;&#1090;&#1086; &#1097;&#1077; &#1075;&#1086; 
&#1080;&#1079;&#1087;&#1088;&#1072;&#1097;&#1072;&#1084;&#1077;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b>R17</b> - &#1057;&#1098;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086; &#1082;&#1086;&#1077;&#1090;&#1086; &#1097;&#1077; 
&#1080;&#1079;&#1087;&#1088;&#1072;&#1097;&#1072;&#1084;&#1077;</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;">&nbsp;</p>
<p style="text-indent: 33px;">
<a href="0.70/scr/kernel/irq.inc"><font size="4">irq.inc</font></a></p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><font size="4">
OSSaveTaskIRQTableF</font><b>:</b>&nbsp;&nbsp;&nbsp; - &#1047;&#1072;&#1087;&#1080;&#1089;&#1074;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;&#1090;&#1072; &#1079;&#1072; 
&#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1074; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;&#1090;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072;, &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; &#1079;&#1072; IRQ</p>
<p style="text-indent: 13px; margin-top: 1px; margin-bottom: 0pt;"><span lang="bg">&nbsp;&nbsp;&nbsp;&nbsp;
</span><b>R16</b> - &#1053;&#1086;&#1084;&#1077;&#1088; &#1085;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1072;<br>
<span lang="bg">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span><b>R17</b> - 
IRQ<span lang="bg"> &#1085;&#1086;&#1084;&#1077;&#1088; / &#1079;&#1072;&#1089;&#1077;&#1075;&#1072; &#1089;&#1072;&#1084;&#1086; </span><b>INT_0</b> <span lang="bg">&#1080;
</span><b>INT_1</b> /<br>
<span lang="bg">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span><b>X</b> -
<span lang="bg">&#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1085;&#1072; &#1087;</span>&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072;<span lang="bg">&#1090;&#1072;</span>
<span lang="bg">&#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072;&#1097;&#1072; </span>&#1087;&#1088;&#1077;&#1082;&#1098;&#1089;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086;</p>
<p style="text-indent: 33px;">&nbsp;</p>
<p style="text-indent: 33px;">
<a href="0.70/scr/kernel/timer.inc"><font size="4">timer.inc</font></a></p>
<p style="text-indent: 12px;"><b>OSRunTimerF: - </b><span lang="bg">&#1057;&#1090;&#1072;&#1088;&#1090;&#1080;&#1088;&#1072; </span>
TIMER0</p>

<p style="text-indent: 12px;">&nbsp;</p>

<p style="text-indent: 12px;"><b><span lang="bg">
<a href="0.70/0.70.rar">&#1045;&#1090;&#1086; &#1080; &#1077;&#1076;&#1080;&#1085; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077;&#1085; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;</a></span></b></p>

<p style="margin-top: 0pt; margin-bottom: 0pt;" align="right"><b><font size="4">04</font><span lang="bg"><font size="4"> &#1070;&#1085;&#1080; 
2006&#1075;.</font></span></b></p>

<p style="margin-top: 0pt; margin-bottom: 0pt;" align="right"><font size="4"><b>14</b></font><b><span lang="bg"><font size="4"> &#1070;&#1085;&#1080; 
2006&#1075;.</font></span></b></p>

</body></html>